root-2.3.0/run/PenetrationFOAM/penetration/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-3;

vertices
(
    (0 0 0)
    (8 0 0)
    (28 0 0)
    (36 0 0)
    (8 16 0)
    (28 16 0)
    (0 36 0)
    (8 36 0)
    (28 36 0)
    (36 36 0)
    (8 16 0.5)
    (28 16 0.5)
    (8 36 0.5)
    (28 36 0.5)
    (8 16 1.2)
    (28 16 1.2)
    (8 36 1.2)
    (28 36 1.2)
    (8 16 1.3)
    (28 16 1.3)
    (8 36 1.3)
    (28 36 1.3)
    (8 16 2)
    (28 16 2)
    (8 36 2)
    (28 36 2)
    (0 0 2.5)
    (8 0 2.5)
    (28 0 2.5)
    (36 0 2.5)
    (8 16 2.5)
    (28 16 2.5)
    (0 36 2.5)
    (8 36 2.5)
    (28 36 2.5)
    (36 36 2.5)
);

blocks
(
    hex (0 1 7 6 26 27 33 32) (2 9 25) simpleGrading (1 1 1)
    hex (1 2 5 4 27 28 31 30) (5 4 25) simpleGrading (1 1 1)
    hex (2 3 9 8 28 29 35 34) (2 9 25) simpleGrading (1 1 1)
    hex (4 5 8 7 10 11 13 12) (5 5 5) simpleGrading (1 1 1)
    hex (10 11 13 12 14 15 17 16) (5 5 7) simpleGrading (1 1 1)
    hex (14 15 17 16 18 19 21 20) (5 5 1) simpleGrading (1 1 1)
    hex (18 19 21 20 22 23 25 24) (5 5 7) simpleGrading (1 1 1)
    hex (22 23 25 24 30 31 34 33) (5 5 5) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch aeration
    (
        (0 1 27 26)
        (1 2 28 27)
        (2 3 29 28)
    )
    patch xsides
    (
        (0 6 32 26)
        (3 9 35 29)
    )
    patch zsides
    (
        (0 1 7 6)
        (1 2 5 4)
        (4 5 8 7)
        (2 3 9 8)
        (26 27 33 32)
        (27 28 31 30)
        (30 31 34 33)
        (28 29 35 34)
    )
    patch outlet
    (
        (6 7 33 32)
        (7 8 13 12)
        (16 17 21 20)
        (24 25 34 33)
        (8 9 35 34)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
