root-2.3.0/run/PenetrationFOAM/penetration/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    aeration
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 100000;
    }
    xsides
    {
        type            fixedValue;
        value           uniform 100000;
    }
    zsides
    {
        type            fixedValue;
        value           uniform 100000;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 100000;
    }
    defaultFaces
    {
        type            empty;
    }
    semiConductor
    {
        type            calculated;
        value           nonuniform List<scalar> 
350
(
100000
100000
100000
100000
100000
100000
100000
100000
...
)
;
    }
    semiConductor-shadow
    {
        type            calculated;
        value           nonuniform List<scalar> 
350
(
0
0
0
0
0
0
0
0
...
)
;
    }
}


// ************************************************************************* //
