root-2.3.0/run/PenetrationFOAM/penetration/0/alpha.air.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.air.org;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    aeration
    {
        type            zeroGradient;
    }
    xsides
    {
        type            zeroGradient;
    }
    zsides
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
    semiConductor
    {
        type            calculated;
        value           uniform 0;
    }
    semiConductor-shadow
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
