root-2.3.0/run/PenetrationFOAM/penetration/0/k.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-05;

boundaryField
{
    aeration
    {
        type            fixedValue;
        value           uniform 3.75e-05;
    }
    xsides
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      uniform 3.75e-05;
        value           uniform 3.75e-05;
    }
    zsides
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      uniform 3.75e-05;
        value           uniform 3.75e-05;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      uniform 3.75e-05;
        value           uniform 3.75e-05;
    }
    defaultFaces
    {
        type            empty;
    }
    semiConductor
    {
        type            calculated;
        value           nonuniform List<scalar> 
350
(
3.75e-05
3.75e-05
3.75e-05
3.75e-05
3.75e-05
3.75e-05
3.75e-05
3.75e-05
...
)
;
    }
    semiConductor-shadow
    {
        type            calculated;
        value           nonuniform List<scalar> 
350
(
0
0
0
0
0
0
0
0
...
)
;
    }
}


// ************************************************************************* //
