root-2.3.0/run/PenetrationFOAM/penetration/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;


baffles
{
    baffleFaces
    {
        type        faceZone;
        zoneName    semiConductor;

        patches
        {
            master
            {
                name            semiConductor;
                type            wall;

                patchFields
                {
                  T.air
                }
            }
            slave
            {
                name            semiConductor-shadow;
                $master;
            }
        }
    }
}


// ************************************************************************* //
