root-2.3.0/run/PenetrationFOAM/penetration/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict.1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    semiConductor;
        type    faceSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            //box (0.008 0.016 0.0005) (0.028 0.036 0.0012);
            box (0.008 0.016 0.0013) (0.028 0.036 0.002);
        }
    }
    {
        name    semiConductor;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet semiConductor;
        }
    }
);

// ************************************************************************* //
